project/app/controllers/application_controller.rb

SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def current_manipulatorid
      @current_manipulatorid ||= Manipulator.find(session[:current_manipulatorid]) if session[:current_manipulatorid]

SELECT "notices".* FROM "notices" WHERE "notices"."manipulator_id" = ?  [["manipulator_id", 16]]
---
    def unread_count
      count = 0
      @current_manipulatorid.notices.each do |notice|
        if count > 99
          break
        end
        if notice.wh状态 == "未读"
          count = count + 1
        end
      end
      @current_manipulatorid.messages.each do |message|