project/app/controllers/comments_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("内容", "created_at", "updated_at", "song_id", "com_manipulator_id") VALUES (?, ?, ?, ?, ?)  [["内容", "sd"], ["created_at", "2023-04-03 07:16:44.202860"], ["updated_at", "2023-04-03 07:16:44.202860"], ["song_id", 1], ["com_manipulator_id", 4]]
---
  def create
    @song = Song.find(params[:song_id])
    @comment = Comment.new(comment_params)
    @comment.manipulator = @current_manipulatorid
    @comment.song = @song

    respond_to do |format|
      if @comment.save