project/app/controllers/manipulators_controller.rb

SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."名称" = ? AND "manipulators"."密码" = ? AND "manipulators"."类型" = ? ORDER BY "manipulators"."id" ASC LIMIT ?  [["名称", "q"], ["密码", "q"], ["类型", "管理员"], ["LIMIT", 1]]
---
  def do_login
    if params[:名称] == "" or params[:密码] == ""
      if params[:类型] == "管理员"
        redirect_to manager_login_manipulators_url, notice: 'Please fill out!'
        return
      else
        redirect_to user_login_manipulators_url, notice: 'Please fill out!'
        return
      end
    end
    manipulator = Manipulator.where({"名称": params[:名称], "密码": params[:密码], "类型": params[:类型]}).first

SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."名称" = ? ORDER BY "manipulators"."id" ASC LIMIT ?  [["名称", "lhq"], ["LIMIT", 1]]
INSERT INTO "manipulators" ("名称", "密码", "类型", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["名称", "l"], ["密码", "l"], ["类型", "用户"], ["created_at", "2023-04-01 15:06:52.141052"], ["updated_at", "2023-04-01 15:06:52.141052"]]
INSERT INTO "pictures" ("图片", "created_at", "updated_at", "song_id", "manipulator_id") VALUES (?, ?, ?, ?, ?)  [["图片", "default.jpg"], ["created_at", "2023-04-01 15:06:52.152975"], ["updated_at", "2023-04-01 15:06:52.152975"], ["song_id", nil], ["manipulator_id", 15]]
---
  def do_register
    if params[:名称] == "" or params[:密码] == ""
      if params[:类型] == "管理员"
        redirect_to manager_register_manipulators_url, notice: 'Please fill out!'
        return
      else
        redirect_to user_register_manipulators_url, notice: 'Please fill out!'
        return
      end
    end
    manipulator = Manipulator.where("名称": params[:名称]).first
    if manipulator
      if params[:类型] == "管理员"
        redirect_to manager_register_manipulators_url, notice: 'Duplicate username!'
        return
      else
        redirect_to user_register_manipulators_url, notice: 'Duplicate username!'
        return
      end
    else
      @manipulator = Manipulator.new({"名称": params[:名称], "密码": params[:密码], "类型": params[:类型]})
      @picture = Picture.new({"图片": "default.jpg"})
      @manipulator.头像 = @picture
      respond_to do |format|
        if @manipulator.save

SELECT "manipulators".* FROM "manipulators"
---
  def index
    @manipulators = Manipulator.all

DELETE FROM "manipulators" WHERE "manipulators"."id" = ?  [["id", 12]]
SELECT "songs".* FROM "songs" WHERE "songs"."manipulator_id" = ?  [["manipulator_id", 11]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."song_id" = ?  [["song_id", 1]]
DELETE FROM "manipulators" WHERE "manipulators"."id" = ?  [["id", 2]]
---
  def destroy
    if @manipulator.头像.图片 != 'default.jpg'
      File.delete("#{Rails.root}/app/assets/images/#{@manipulator.头像.图片}")
    end
    @manipulator.songs.each do |song|
      song.pictures.each do |picture|
        filename = picture.图片
        File.delete("#{Rails.root}/app/assets/images/#{filename}")
      end
    end
    if @manipulator.id == @current_manipulatorid.id
      session.delete(:current_manipulatortype)
      session.delete(:current_manipulatorid)
      @manipulator.destroy
      respond_to do |format|
        format.html { redirect_to manager_login_manipulators_url, notice: "Manipulator was successfully destroyed." }
        format.json { head :no_content }
      end
      return
    end
    @manipulator.destroy

SELECT "manipulators".* FROM "manipulators" WHERE "manipulators"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_manipulator
      @manipulator = Manipulator.find(params[:id])