project/app/controllers/reports_controller.rb

  def index
    if params[:状态] == nil
      @reports = Report.where({"状态": "待审核"}).all
---
SELECT "reports".* FROM "reports" WHERE "reports"."状态" = ?  [["状态", "待审核"]]

  def create
    @manipulator = @current_manipulatorid
    @song = Song.find(params[:song_id])
    @comment = Comment.find(params[:comment_id])
    if @manipulator == @comment.manipulator
        redirect_to @song, message: "不能举报自己的评论！"
      return
    end
    @report = Report.new(report_params)
    @report.comment = @comment
    @report.manipulator = @manipulator
    @report.状态 = "待审核"

    # 新建通知
    @notice = Notice.new()
    @notice.类型 = "举报"
    @notice.whistleblower = @manipulator
    @notice.manipulator = @comment.manipulator
    @notice.内容 = @report.comment.内容
    @notice.原因 = @report.内容
    @notice.wh状态 = "未读"
    @notice.ma状态 = "未读"

    respond_to do |format|
      if @notice.save and @report.save
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notices" ("类型", "wh状态", "ma状态", "内容", "原因", "whistleblower_id", "manipulator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "reports" ("内容", "created_at", "updated_at", "状态", "comment_id", "manipulator_id") VALUES (?, ?, ?, ?, ?, ?)  [["内容", "adasd"], ["created_at", "2023-04-03 07:17:02.456046"], ["updated_at", "2023-04-03 07:17:02.456046"], ["状态", "待审核"], ["comment_id", 1], ["manipulator_id", 3]]