project/app/controllers/song_types_controller.rb

SELECT "song_types".* FROM "song_types"
---
  def index
    @song_types = SongType.all

INSERT INTO "song_types" ("名称", "created_at", "updated_at") VALUES (?, ?, ?)  [["名称", "dadf"], ["created_at", "2023-04-02 02:43:05.735479"], ["updated_at", "2023-04-02 02:43:05.735479"]]
---
  def create
    @song_type = SongType.new(song_type_params)

    respond_to do |format|
      if @song_type.save

UPDATE "songs" SET "song_type_id" = ? WHERE "songs"."song_type_id" = ?  [["song_type_id", nil], ["song_type_id", 6]]
---
  def update
    respond_to do |format|
      if @song_type.update(song_type_params)

DELETE FROM "song_types" WHERE "song_types"."id" = ?  [["id", 6]]
---
  def destroy
    @song_type.destroy

SELECT "song_types".* FROM "song_types" WHERE "song_types"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_song_type
      @song_type = SongType.find(params[:id])