project/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)
    @song.manipulator = @current_manipulatorid
    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("演唱", "作词", "作曲", "created_at", "updated_at", "名称", "manipulator_id", "song_type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @song.pictures.each do |picture|
      filename = picture.图片
      File.delete("#{Rails.root}/app/assets/images/#{filename}")
    end
    @song.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."song_id" = ?  [["song_id", 1]]
DELETE FROM "pictures" WHERE "pictures"."song_id" = ?  [["song_id", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]