project/app/views/manipulators/my_page.html.erb

    <tbody>
      <% @manipulator.notices.each do |notice| %>
---
SELECT "notices".* FROM "notices" WHERE "notices"."manipulator_id" = ?  [["manipulator_id", 2]]