project/app/views/songs/_form.html.erb

    类型
    <%= form.collection_radio_buttons :song_type_id, SongType.all, :id, :名称 do |b| %>
---
SELECT "song_types".* FROM "song_types"