project/app/views/songs/show.html.erb

<% content_for :javascript do %>
  <%= javascript_include_tag "jquery.min", "comment" %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."song_id" = ?  [["song_id", 1]]